results/routeA/initialization_check/A-Ra1e6-coarse/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.1760563380281691
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.176056338028169
-0.5281690140845071
-0.8802816901408452
-1.232394366197183
-1.584507042253521
-1.936619718309859
-2.288732394366197
-2.640845070422535
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.176056338028169
-0.5281690140845071
-0.8802816901408452
-1.232394366197183
-1.584507042253521
-1.936619718309859
-2.288732394366197
-2.640845070422535
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
