results/routeA/initialization_check/A-Ra1e6-coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
-0.176056338028169
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.1759683098591549
-0.5279049295774648
-0.8798415492957746
-1.231778169014085
-1.583714788732394
-1.935651408450704
-2.287588028169014
-2.639524647887324
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.1761443661971831
-0.5284330985915493
-0.8807218309859155
-1.233010563380282
-1.585299295774648
-1.937588028169014
-2.28987676056338
-2.642165492957746
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -14.08450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
